curvedDuctFlowPiso/opt/openfoam240/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   ( 0 0 0 );
        value               uniform ( 0 0 0 );
    }
    ground
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    blockedFaces
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    baffleWall
    {
        type            activePressureForceBaffleVelocity;
        value           uniform ( 0 0 0 );
        cyclicPatch     baffleCyclic_half0;
        orientation     1;
        openingTime     0.01;
        maxOpenFractionDelta 0.1;
        openFraction    0;
        p               p;
        minThresholdValue 8000;
        forceBased      0;
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
